{
  "component-definition": {
    "uuid": "D9E2E17D-1B83-4746-84B1-A73F9671B96A",
    "metadata": {
      "title": "BigBang",
      "last-modified": "2021-10-19T12:00:00Z",
      "version": 20211019,
      "oscal-version": "1.0.0",
      "roles": [
        {
          "id": "provider",
          "title": "Provider"
        }
      ],
      "parties": [
        {
          "uuid": "72134592-08C2-4A77-ABAD-C880F109367A",
          "type": "organization",
          "name": "Platform One",
          "links": [
            {
              "href": "<https://p1.dso.mil>",
              "rel": "website"
            }
          ]
        }
      ]
    },
    "components": [
      {
        "uuid": "E70A5057-3BA4-4E62-8C74-ED19122BBA9E",
        "type": "software",
        "title": "Authservice",
        "set-parameters": [
          {
            "param-id": "2_prm_1",
            "values": [
              "Parameter from Component"
            ]
          }
        ],
        "description": "an implementation of thee Envoy External Authorization focused on handling AuthN/AuthZ \nfor Istio and Kubernetes.\n",
        "purpose": "Provides authn/authz capabilites to applications via Istio Service Mesh",
        "responsible-roles": [
          {
            "role-id": "provider",
            "party-uuid": "72134592-08C2-4A77-ABAD-C880F109367A"
          }
        ],
        "control-implementations": [
          {
            "uuid": "5108E5FC-C45F-477B-A542-9C5611A92485",
            "source": "https://raw.githubusercontent.com/usnistgov/oscal-content/master/nist.gov/SP800-53/rev5/json/NIST_SP-800-53_rev5_catalog.json",
            "description": "Controls inherited by configuration of Bigbang using Authservice",
            "implemented-requirements": [
              {
                "uuid": "C6F6C8F4-37A4-4224-8BFD-C60860E56345",
                "control-id": "ac-2",
                "description": "Authservice validates requests in the Istio service mesh have a token from the configured Identity provider in the headers.  If a request is missing the header token from the identity provider, it will redirect the\n request to the Identity Provider to obtain a token. \n\nEach application behind authservice can be configured with a unique client_id and client_secret, allowing  access management of the application to be completely inhertied by the identity provider."
              },
              {
                "uuid": "6551B643-7958-4615-81D4-FBBB2E42B212",
                "control-id": "ac-2.1",
                "description": "Account management can be offloaded to the Identity Provider"
              },
              {
                "uuid": "4493AA67-2B74-47BB-95F7-450CC243BF04",
                "control-id": "ac-2.2",
                "description": "Accounts can be removed and disabled from the Identity provider"
              },
              {
                "uuid": "D8517E02-E5CE-453C-8750-7183E77A95B7",
                "control-id": "ac-2.3",
                "description": "Accoutns can be disabled via the Identity Provider"
              },
              {
                "uuid": "08D5E163-E125-4D47-BCE9-42EAE6868F66",
                "control-id": "ac-3",
                "description": "The Istio `RequestAuthorizatoin` policies `jwt-authn`, `authservice` and `jwt-authz` provided by the Authservice Big Bang Helm chart ensure that network traffic has a token, has a token from the identity provider,  and was approved by Authservice.  If any of those are not true, the Istio dataplane will block traffic to the destintation requested."
              },
              {
                "uuid": "6B22B7C8-2446-4BA0-88E3-C695CF2CD08E",
                "control-id": "ac-6",
                "description": "Authservice ensures that least privilege is used when accessing the system by allowing the Identity provider to provide the ac-6 control."
              },
              {
                "uuid": "6282750E-8519-47B7-AB85-C2CADA23504B",
                "control-id": "ac-7",
                "description": "The use of Authservice enables AC-7 to be inherited by the Identity Provider because logins to the  application are controled by the Identity Provider and the application cannot be accessed without a valid login and authorization check by the Identity Provider."
              },
              {
                "uuid": "83E3FD08-F4F4-4CDF-95EC-5A314D920D3E",
                "control-id": "ac-8",
                "description": "The use of Authservice enables AC-8 to be inherited by the Identity Provider because logins to the  application are controled by the Identity Provider and the application cannot be accessed without a valid login and authorization check by the Identity Provider."
              },
              {
                "uuid": "03B8D342-6DFE-4233-9002-196C23C5229B",
                "control-id": "ac-9",
                "description": "The use of Authservice enables AC-9 to be inherited by the Identity Provider because logins to the  application are controled by the Identity Provider and the application cannot be accessed without a valid login and authorization check by the Identity Provider."
              },
              {
                "uuid": "03B8D342-6DFE-4233-9002-196C23C5229B",
                "control-id": "ac-10",
                "description": "The use of Authservice enables AC-9 to be inherited by the Identity Provider because logins to the  application are controled by the Identity Provider and the application cannot be accessed without a valid login and authorization check by the Identity Provider."
              },
              {
                "uuid": "A0546272-BEF7-402A-AD1A-BE13C7CA43A3",
                "control-id": "ac-11",
                "description": "Need to see if Keycloak has this built in and if we login via a CaC,and then remove the cac  if the session to our application is suspended."
              },
              {
                "uuid": "03B8D342-6DFE-4233-9002-196C23C5229B",
                "control-id": "ac-12",
                "description": "The use of Authservice enables AC-12 to be inherited by the Identity Provider because logins to the  application are controled by the Identity Provider and the application cannot be accessed without a valid login and authorization check by the Identity Provider."
              },
              {
                "uuid": "03B8D342-6DFE-4233-9002-196C23C5229B",
                "control-id": "ac-13",
                "description": "The use of Authservice enables AC-13 to be inherited by the Identity Provider because logins to the  application are controled by the Identity Provider and the application cannot be accessed without a valid login and authorization check by the Identity Provider."
              },
              {
                "uuid": "03B8D342-6DFE-4233-9002-196C23C5229B",
                "control-id": "ac-16",
                "description": "The use of Authservice enables AC-13 to be inherited by the Identity Provider because logins to the  application are controled by the Identity Provider and the application cannot be accessed without a valid login and authorization check by the Identity Provider.  Upon authorization, group  membership can be provided for the logged in subject to enable the application to make  determinations on subjects approval for using the application and seeing restricted objects."
              },
              {
                "uuid": "8488D879-062B-4E90-A1C6-7B4F0D53E774",
                "control-id": "ac-24",
                "description": "The authservice AuthorizationPolicy is used by Istio to make Access Control Decisions.  This service provides a critical determination for workloads protected by Authservice to ensure that only authorized subjects are allowed to access the workload."
              },
              {
                "uuid": "D7CE4AB9-09D7-48D8-BC2E-A28422B671C4",
                "control-id": "ac-25",
                "description": "Authservice configured at the gateway applies to all traffic ingressing into the system via the gateway."
              }
            ]
          }
        ]
      },
      {
        "uuid": "405365A0-F12B-418B-BC90-2336C3BCC84B",
        "type": "software",
        "title": "Istio",
        "description": "Istio Service Mesh implemented in Big Bang\n",
        "purpose": "Provides observibility and traffic management for",
        "responsible-roles": [
          {
            "role-id": "provider",
            "party-uuid": "72134592-08C2-4A77-ABAD-C880F109367A"
          }
        ],
        "control-implementations": [
          {
            "uuid": "5108E5FC-C45F-477B-A542-9C5611A92485",
            "source": "https://raw.githubusercontent.com/usnistgov/oscal-content/master/nist.gov/SP800-53/rev5/json/NIST_SP-800-53_rev5_catalog.json",
            "description": "Controls inherited by configuration of Bigbang using Istio",
            "implemented-requirements": [
              {
                "uuid": "6B22B7C8-2446-4BA0-88E3-C695CF2CD08E",
                "control-id": "ac-4",
                "description": "Istio provides network isolation between components in the Kubernetes cluster based on the SPIFFE/SPIRE of the component and how they apply to the AuthorizationRules defined in the system. "
              },
              {
                "uuid": "6B22B7C8-2446-4BA0-88E3-C695CF2CD08E",
                "control-id": "ac-6",
                "description": "Istio provides least privilege between components by having a granular view of the  identities of workloads in the cluster and being able to apply granular  AuthorizationPolicies to those workloads."
              },
              {
                "uuid": "B8201E9C-0012-4C5A-AB4D-7F80F5C0853D",
                "control-id": "ac-20",
                "description": "Istio provides the ability to prevent network connectivity to external components by the use of authorization policies and service meshy things."
              },
              {
                "uuid": "0AEF15AD-0562-449E-9695-0EA826A7813D",
                "control-id": "ac-23",
                "description": "Data Mining protection is available via istio by limiting the number of concurrent  connections by a user.  Additionally, the granular control of AuthorizationRules by istio on a path basis allow for control of how data can egress."
              },
              {
                "uuid": "6CB10F6B-EB26-4525-9B9F-BF63583E363D",
                "control-id": "ac-24",
                "description": "Access Control decision is made by the Istio sidecar to determine if  AuthorizationPolicies apply to the requested traffic."
              },
              {
                "uuid": "D7CE4AB9-09D7-48D8-BC2E-A28422B671C4",
                "control-id": "ac-25",
                "description": "Istio can be configured to ensure that only endpoints registered in the ServiceMesh are accessable by workloads.  Istio configurations in the istio-system namespace get applied globally to the cluster and provide a central configuration for acceess management"
              }
            ]
          }
        ]
      }
    ]
  }
}
